[
  {
    "id": 1728740156003,
    "title": "Harry Potter and the Sorcerer's Stone",
    "author": "J. K. Rowling",
    "review": "Harry Potter and the Sorcerer's Stone is a captivating introduction to the magical world of Hogwarts and the beloved characters who inhabit it. J.K. Rowling takes readers on a journey with Harry, a boy who discovers his extraordinary heritage and the power of friendship as he navigates his first year at a school for wizards. The richly imagined setting, with its enchanted halls and quirky traditions, enhances the story, while the themes of bravery, loyalty, and the battle between good and evil resonate deeply. Rowling's engaging writing style and humor make the narrative accessible and enjoyable for readers of all ages, creating a timeless classic that continues to ignite the imagination and warm the heart.",
    "cover": "https://res.cloudinary.com/djgevocmm/image/upload/v1728989354/book-reviews/vqbtyqftam35acg8mpvo.jpg",
    "fullImage": "https://res.cloudinary.com/djgevocmm/image/upload/v1728989357/book-reviews/omda3vktuo81ghkjiinn.jpg"
  },
  {
    "id": 1728740226562,
    "title": "A Little Life",
    "author": " Hanya Yanagihara",
    "review": "A Little Life by Hanya Yanagihara is an intensely moving novel that follows the lives of four friends—Jude, Willem, JB, and Malcolm—in New York City. The story deeply explores Jude’s traumatic past, revealing the raw struggles and complexities of friendship, love, and healing.\r\n\r\nYanagihara’s writing left me both heartbroken and reflective. I found myself captivated by the characters and their unbreakable bonds, even in the face of unimaginable pain. This book isn’t just about suffering; it’s a powerful reminder of the resilience of the human spirit and the importance of compassion. It’s a haunting read that has stayed with me long after I finished it. By the time i finished reading this book, i had forgotten the times  had already cried.",
    "cover": "https://res.cloudinary.com/djgevocmm/image/upload/v1728989459/book-reviews/jkhj8jlx2kzsfizhlpkk.jpg",
    "fullImage": "https://res.cloudinary.com/djgevocmm/image/upload/v1728989461/book-reviews/jnnetsuw0iqepvbuueb7.jpg"
  },
  {
    "id": 1728740503675,
    "title": "The Seven Husbands of Evelyn Hugo",
    "author": "Taylor Jenkins Reid",
    "review": "The Seven Husbands of Evelyn Hugo by Taylor Jenkins Reid is an utterly captivating read that pulled me in from the first page. The story unfolds through the eyes of Evelyn Hugo, a glamorous and complex Hollywood icon who recounts her life and the seven marriages that defined her.\r\n\r\nWhat struck me most was how human and relatable Evelyn felt, despite her fame. Her journey through love, loss, and self-discovery resonated deeply with me. Reid's writing is both lush and sharp, effortlessly blending the glitz of old Hollywood with raw emotion and insight into identity and ambition.\r\n\r\nI loved how the narrative challenges societal norms around love and relationships, showing that they’re rarely straightforward. This book isn’t just about the husbands; it’s about Evelyn’s quest for herself amidst the chaos of her life. It’s a beautiful exploration of what it means to be a woman in a world that constantly tries to define you. This novel will stay with me long after finishing it—definitely a must-read!",
    "cover": "https://res.cloudinary.com/djgevocmm/image/upload/v1728989484/book-reviews/p8qpjokfvixzeo5fohav.jpg",
    "fullImage": "https://res.cloudinary.com/djgevocmm/image/upload/v1728989486/book-reviews/uwguk9rcam737kcuntwk.jpg"
  },
  {
    "id": 1728837165691,
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "review": "Reading Pride and Prejudice feels like entering a world where every interaction is rich with meaning. Elizabeth Bennet quickly became a favorite character of mine; her independence and wit resonate deeply. The dynamic between Elizabeth and Mr. Darcy is electric, and their journey from misunderstandings to mutual respect mirrors our own experiences with love.\r\n\r\nAusten’s sharp observations on class and gender roles make me reflect on contemporary issues while inspiring me to prioritize love and respect in my own relationships. The supporting cast adds humor and depth, making the story even more engaging.\r\n\r\nUltimately, Pride and Prejudice is more than just a love story; it's a heartfelt exploration of human nature and connection. Each read reveals new insights, making it a cherished favorite that I return to time and again.",
    "cover": "https://res.cloudinary.com/djgevocmm/image/upload/v1728989509/book-reviews/m9kp6maayoywvmxhhfct.png",
    "fullImage": "https://res.cloudinary.com/djgevocmm/image/upload/v1728989511/book-reviews/bvmtz5jbxnqpybrvgy96.jpg"
  }
]
